Donien-mixi/PROJECT_13_PHAT_HIEN_TAI_XE_BUON_NGU/firmware_esp32/sdkconfig.defaults
# ==============================================================================
# ESP32-S3 N16R8 Hardware Configuration (16MB Flash, 8MB Octal PSRAM)
# Project 13: Edge AI Driver Drowsiness & Distraction Detection
# ==============================================================================

# Target Chip
CONFIG_IDF_TARGET="esp32s3"

# CPU Clock Frequency: 240 MHz (Maximum Performance for Edge AI)
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# Flash Memory: 16MB QIO 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition Table: Custom 4MB App Partition (TFLite Micro + esp-nn ~1.3MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Octal PSRAM: 8MB @ 80MHz OPI Mode
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# Compiler Optimization for Speed
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# Performance: Max caches + move app code/rodata to PSRAM to free internal SRAM for the TFLM arena
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Watchdog: Edge AI task on Core 1 blocks for long CSI/DSP bursts -> do not watch CPU1 idle task
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1 is not set

# LWIP / Network Performance
CONFIG_LWIP_TCP_MSS=1440CONFIG_LWIP_TCP_WND_DEFAULT=14400
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# Logging Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
